app/controllers/handles_controller.rb

  def show
    @handle = Handle.find(params[:id])
---
SELECT  "handles".* FROM "handles" WHERE "handles"."id" = ? LIMIT 1  [["id", 1]]