app/controllers/sessions_controller.rb

INSERT INTO "identities" ("uid", "provider", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["uid", "3332366652"], ["provider", "twitter"], ["created_at", "2016-01-06 23:17:47.572615"], ["updated_at", "2016-01-06 23:17:47.572615"]]
UPDATE "identities" SET "user_id" = ?, "updated_at" = ? WHERE "identities"."id" = ?  [["user_id", 1], ["updated_at", "2016-01-06 23:45:38.428418"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def create
    auth = request.env['omniauth.auth']

    # Find an identity here
    @identity = Identity.find_with_omniauth(auth)

    if @identity.nil?
      # If no identity was found, create a brand new one here
      @identity = Identity.create_with_omniauth(auth)
    end

    # CURRENTLY, all this is linking the identity to the user, not linking any feeds or follower handles
    if signed_in?
      if @identity.user == current_user
        # Occurs when a user is logged in, and tries to link via a provider they've already linked before
        redirect_to root_path, notice: "Already linked that account!"
      else
        # Linking an identity with the signed in user. Identity hasn't previously been linked with user.
        # This also merges the handles each user account follows
        current_user.merge_user_accounts(@identity.user) unless @identity.user.nil?

        @identity.user = current_user
        @identity.save
        redirect_to root_path, notice: "Successfully linked that account!"
      end
    else
      # not signed in
      if @identity.user.present?

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jenna Nichols"], ["created_at", "2016-01-06 23:17:47.583781"], ["updated_at", "2016-01-06 23:17:47.583781"]]
---
        self.current_user = @identity.user
        redirect_to root_path, notice: "Signed in!"
      else
        # user has not signed in to the site with either account (twitter or vimeo); it's a completely new user.
        @user = User.create_with_omniauth(auth["info"])